---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ViewScheduleExportOptions Properties
ViewScheduleExportOptions Class See Also Send Feedback
---

The ViewScheduleExportOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ColumnHeaders | How to export column headers. Default is MultipleRows. |
|  | FieldDelimiter | How to delimit fields. Default is Tab. |
|  | HeadersFootersBlanks | Whether to export group headers, footers, and blank lines. Default is true. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TextQualifier | How to qualify text fields. Default is DoubleQuote. |
|  | Title | Whether or not to export the schedule title. Default is true. |

# See Also

ViewScheduleExportOptions Class

Autodesk.Revit.DB Namespace